app/views/users/index.html.erb

     <td><%= user.email %></td>
      <% user.address.each do |ua| %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 1]]