app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "venkatesh"], ["email", "venkatesh.se05@gmail.com"], ["created_at", "2015-04-29 07:27:04.412835"], ["updated_at", "2015-04-29 07:27:04.412835"]]
---
  def create
  	@user = User.create user_params